James-Reilley-Bose/Professor_LPM_diags/Diagnostics/Core/Drivers/ST/STM32F2xx/DeviceSupport/iar/stm32f2xx_interrupts.c
/*******************************************************************************
* Function Name  : PVD_IRQHandler
* Description    : This function handles PVD interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ PVD_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : TAMPER_IRQHandler
* Description    : This function handles Tamper interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ TAMPER_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : RTC_IRQHandler
* Description    : This function handles RTC global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ RTC_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : FLASH_IRQHandler
* Description    : This function handles Flash interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ FLASH_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : RCC_IRQHandler
* Description    : This function handles RCC interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ RCC_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : EXTI0_IRQHandler
* Description    : This function handles External interrupt Line 1 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ EXTI0_IRQHandler(void)
{
   debug_assert(0);
   EXTI->PR = EXTI_Line0;
}

/*******************************************************************************
* Function Name  : EXTI1_IRQHandler
* Description    : This function handles External interrupt Line 1 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ EXTI1_IRQHandler(void)
{
   debug_assert(0);
   EXTI->PR = EXTI_Line1;
}

/*******************************************************************************
* Function Name  : EXTI2_IRQHandler
* Description    : This function handles External interrupt Line 2 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ EXTI2_IRQHandler(void)
{
   debug_assert(0);
   EXTI->PR = EXTI_Line2;
}

/*******************************************************************************
* Function Name  : EXTI3_IRQHandler
* Description    : This function handles External interrupt Line 3 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ EXTI3_IRQHandler(void)
{
   debug_assert(0);
   EXTI->PR = EXTI_Line3;
}

/*******************************************************************************
* Function Name  : EXTI4_IRQHandler
* Description    : This function handles External interrupt Line 4 request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ EXTI4_IRQHandler(void)
{
   debug_assert(0);
   EXTI->PR = EXTI_Line4;
}

/*******************************************************************************
* Function Name  : DMA1_Stream0_IRQHandler
* Description    : This function handles DMA1 Stream 0 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ DMA1_Stream0_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : DMA1_Stream1_IRQHandler
* Description    : This function handles DMA1 Channel 2 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ DMA1_Stream1_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : DMA1_Stream2_IRQHandler
* Description    : This function handles DMA1 Channel 3 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ DMA1_Stream2_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : DMA1_Stream3_IRQHandler
* Description    : This function handles DMA1 Channel 4 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ DMA1_Stream3_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : DMA1_Stream4_IRQHandler
* Description    : This function handles DMA1 Channel 5 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ DMA1_Stream4_IRQHandler(void)
{
   debug_assert(0);
}


