James-Reilley-Bose/Professor_LPM_diags/Diagnostics/Core/Drivers/ST/STM32F2xx/DeviceSupport/iar/stm32f2xx_interrupts.c
/*******************************************************************************
* Function Name  : I2C1_EV_IRQHandler
* Description    : This function handles I2C1 Event interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ I2C1_EV_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : I2C1_ER_IRQHandler
* Description    : This function handles I2C1 Error interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ I2C1_ER_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : I2C2_EV_IRQHandler
* Description    : This function handles I2C2 Event interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ I2C2_EV_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : I2C2_ER_IRQHandler
* Description    : This function handles I2C2 Error interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ I2C2_ER_IRQHandler(void)
{
   debug_assert(0);
}

// SPI ISRs are handled in SpiDriver.c

/*******************************************************************************
* Function Name  : EXTI15_10_IRQHandler
* Description    : This function handles External lines 15 to 10 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ EXTI15_10_IRQHandler(void)
{

}

/*******************************************************************************
* Function Name  : RTCAlarm_IRQHandler
* Description    : This function handles RTC Alarm interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ RTCAlarm_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : USBWakeUp_IRQHandler
* Description    : This function handles USB WakeUp interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ USBWakeUp_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : TIM8_BRK_IRQHandler
* Description    : This function handles TIM8 Break interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ TIM8_BRK_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : TIM8_UP_IRQHandler
* Description    : This function handles TIM8 overflow and update interrupt
*                  request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ TIM8_UP_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : TIM8_TRG_COM_IRQHandler
* Description    : This function handles TIM8 Trigger and commutation interrupts
*                  requests.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ TIM8_TRG_COM_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : TIM8_CC_IRQHandler
* Description    : This function handles TIM8 capture compare interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ TIM8_CC_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : ADC3_IRQHandler
* Description    : This function handles ADC3 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ ADC3_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : FSMC_IRQHandler
* Description    : This function handles FSMC global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ FSMC_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : SDIO_IRQHandler
* Description    : This function handles SDIO global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ SDIO_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : TIM5_IRQHandler
* Description    : This function handles TIM5 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ TIM5_IRQHandler(void)
{
    debug_assert(0);
}

