James-Reilley-Bose/Professor_LPM_diags/Diagnostics/Core/Drivers/ST/STM32F2xx/DeviceSupport/iar/stm32f2xx_interrupts.c
/*******************************************************************************
* Function Name  : SPI3_IRQHandler
* Description    : This function handles SPI3 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ SPI3_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : TIM6_IRQHandler
* Description    : This function handles TIM6 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ TIM6_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : TIM7_IRQHandler
* Description    : This function handles TIM7 global interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ TIM7_IRQHandler(void)
{
   //IrTask_HandleTimerInterrupt();
}

/*******************************************************************************
* Function Name  : DMA2_Channel1_IRQHandler
* Description    : This function handles DMA2 Channel 1 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ DMA2_Channel1_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : DMA2_Channel2_IRQHandler
* Description    : This function handles DMA2 Channel 2 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ DMA2_Channel2_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : DMA2_Channel3_IRQHandler
* Description    : This function handles DMA2 Channel 3 interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ DMA2_Channel3_IRQHandler(void)
{
   debug_assert(0);
}

/*******************************************************************************
* Function Name  : DMA2_Channel4_5_IRQHandler
* Description    : This function handles DMA2 Channel 4 and DMA2 Channel 5
*                  interrupt request.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void __arm_irq__ DMA2_Channel4_5_IRQHandler(void)
{
   debug_assert(0);
}

void __arm_irq__ USART1_IRQHandler(void)
{
    BUSART_IRQ(BUSART1);
}

void __arm_irq__ USART2_IRQHandler(void)
{
    BUSART_IRQ(BUSART2);
}

void __arm_irq__ USART3_IRQHandler(void)
{
    BUSART_IRQ(BUSART3);
}

void __arm_irq__ UART4_IRQHandler(void)
{
    BUSART_IRQ(BUSART4);
}

void __arm_irq__ UART5_IRQHandler(void)
{
    BUSART_IRQ(BUSART5);
}

void __arm_irq__ Unhandled_IRQ(void)
{
    debug_assert(0);
}
#endif //  NEW_INTERRUPT_SCHEME

#ifndef IAR_COMPILER
#include <sys/types.h>

caddr_t _sbrk ( int incr )
{
   return 0;
}
#endif

/******************* (C) COPYRIGHT 2008 STMicroelectronics *****END OF FILE****/
